Part 4: 
List:
Create a list of 5 fruits and print the third fruit in the list.
Add two new elements to the list and print the updated list.
Remove the last element from the list and print the list.
Check if 'Apple' is in the list and print the result as a boolean value.
Tuple:
Create a tuple with 3 elements and print the second element.
Try to change an element in the tuple and observe the error.
Concatenate two tuples and print the result.
Set:
Create two sets with some common elements and perform a union operation.
Find the intersection of the two sets.
Add a new element to a set and print the updated set.
Dictionary:
Create a dictionary with 5 key-value pairs representing student names and their scores.
Print all keys from the dictionary.
Update the score of one student and print the updated dictionary.
Numpy:
Create a 1D Numpy array with 5 elements and print the array.
Perform element-wise multiplication of two Numpy arrays.
Calculate the mean of the Numpy array.
Pandas:
Create a Pandas Series from a list of 5 cities and print the series.
Create a Pandas DataFrame from a dictionary with columns 'Name', 'Age', and 'City' containing 3 rows of data.
Sort the DataFrame based on the 'Age' column.
Lambda Function:
Write a lambda function to double a given number.
Write a lambda function to check if a number is even or odd.
Use the lambda function to filter a list of numbers and print only the even numbers.

### PART 4

## LIST

In [1]:
# Create a list of 5 fruits and print the third fruit in the list.

fruits = ['Apple','Banana','Cherry','Dragon Fruit','Egg Plant']
fruits[4]

'Egg Plant'

In [2]:
# Add two new elements to the list and print the updated list.
add_fruits = ['Mango','Orange']
fruits.extend(add_fruits)
fruits

['Apple', 'Banana', 'Cherry', 'Dragon Fruit', 'Egg Plant', 'Mango', 'Orange']

In [3]:
# Remove the last element from the list and print the list.

fruits.pop()
fruits

['Apple', 'Banana', 'Cherry', 'Dragon Fruit', 'Egg Plant', 'Mango']

In [4]:
# Check if 'Apple' is in the list and print the result as a boolean value.

for fruit in fruits:
    if 'Apple' in fruits:
        print (True)
        break

True

### TUPLE

In [5]:
# Create a tuple with 3 elements and print the second element.

my_tuple = ('Bronze','Silver','Gold')

print(my_tuple[1])

Silver

In [6]:
# Try to change an element in the tuple and observe the error.

# my_tuple[1] = 'Diamond'

# TypeError                                 Traceback (most recent call last)
# Cell In[25], line 3
#       1 # Try to change an element in the tuple and observe the error.
# ----> 3 my_tuple[1] = 'Diamond'

# TypeError: 'tuple' object does not support item assignment

In [7]:
# Concatenate two tuples and print the result.

my_second_tuple = ('Diamond',)

my_tuple += my_second_tuple

print(my_tuple)

('Bronze', 'Silver', 'Gold', 'Diamond')

## SET

In [8]:
# Create two sets with some common elements and perform a union operation.

set1 = {'Jack','Danial',37, True}
set2 = {'USA', 38.26, True }

set3 = set1.union(set2)
set3

{37, 38.26, 'Danial', 'Jack', True, 'USA'}

In [9]:
# Find the intersection of the two sets.

set4 = set1.intersection(set2)

set4

{True}

In [10]:
# Add a new element to a set and print the updated set.

set5 = {37, 38.26, 'Danial', 'Jack', True, 'USA'}
set6 = {False, 00.99, 'Frisco'}

set5.update(set6)

set5

{0.99, 37, 38.26, 'Danial', False, 'Frisco', 'Jack', True, 'USA'}

### DICTIONARY

In [11]:

# Create a dictionary with 5 key-value pairs representing student names and their scores.

my_dict = {
 'Full Name': 'John Smith', 
 'State' : 'Lousiana', 
 'Grade': 7, 
 'Percentage(%)':73.25, 
 'Promoted!' : True
}

my_dict

{'Full Name': 'John Smith',
 'State': 'Lousiana',
 'Grade': 7,
 'Percentage(%)': 73.25,
 'Promoted!': True}

In [12]:
# Print all keys from the dictionary.

my_dict.keys()

dict_keys(['Full Name', 'State', 'Grade', 'Percentage(%)', 'Promoted!'])

In [13]:
# Update the score of one student and print the updated dictionary.

my_dict.update({'Score': 657})
my_dict

{'Full Name': 'John Smith',
 'State': 'Lousiana',
 'Grade': 7,
 'Percentage(%)': 73.25,
 'Promoted!': True,
 'Score': 657}

### NUMPY

In [14]:
import numpy as np

# Create a 1D Numpy array with 5 elements and print the array.


myarr1 = np.array([1,2,3,4,5])

myarr1

array([1, 2, 3, 4, 5])

In [15]:
# Perform element-wise multiplication of two Numpy arrays.

myarr2 = np.ones((1,5))

myarr3 = myarr1*myarr2

myarr3

array([[1., 2., 3., 4., 5.]])

In [16]:
# Calculate the mean of the Numpy array.

myarr3.mean()

3.0

### PANDAS

In [17]:
import pandas as pd

# Create a Pandas Series from a list of 5 cities and print the series.

df = pd.Series(['Arizona','Berlin','Chicago','Detroit','Easter Islands'])

df

0           Arizona
1            Berlin
2           Chicago
3           Detroit
4    Easter Islands
dtype: object

In [18]:
# Create a Pandas DataFrame from a dictionary with columns 'Name', 'Age', and 'City' containing 3 rows of data.

df1 = ([{'Name': 'Adam Smith', 'Age' : 37, 'City' : 'Tokyo'}])
df2 = ([{'Name': 'Jack Johnson', 'Age' : 12, 'City' : 'Johanesburg'}])
df3 = ([{'Name': 'Angela Merkel', 'Age' : 66, 'City' : 'Berlin '}])


df4 = df1 + df2 + df3

df4

[{'Name': 'Adam Smith', 'Age': 37, 'City': 'Tokyo'},
 {'Name': 'Jack Johnson', 'Age': 12, 'City': 'Johanesburg'},
 {'Name': 'Angela Merkel', 'Age': 66, 'City': 'Berlin '}]

In [19]:
# Sort the DataFrame based on the 'Age' column.

In [20]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 35, 45, 20, 32],
    'City': ['Berlin','Tokyo','New Orleans', 'San Francisco', 'Florida']
}
df = pd.DataFrame(data)

In [21]:
df.sort_values(by='Age')

      Name  Age           City
3    David   20  San Francisco
0    Alice   25         Berlin
4      Eve   32        Florida
1      Bob   35          Tokyo
2  Charlie   45    New Orleans

### LAMBDA

In [22]:
# Write a lambda function to double a given number.

y = lambda x : x * 2

print(y(10))
print(y(22))
print(y(0.02))

20
44
0.04

In [23]:
# Write a lambda function to check if a number is even or odd.

check_num = lambda x : x % 2 == 0

print(check_num(3))
print(check_num(2))

False
True

In [24]:
# Use the lambda function to filter a list of numbers and print only the even numbers.

In [25]:
list1 = [1,2,3,4,5,6,7,8,9]

check_even = list(filter(lambda x : x % 2 == 0, list1))

print(check_even)

[2, 4, 6, 8]